﻿/* Notification that a user reacted to a post that the current user was tagged in */
"reacted_tagged_in_1" = "%@ reagált a bejegyzésre amiben be voltál jelölve";

/* Notification that 2 users reacted to a post that the current user was tagged in */
"reacted_tagged_in_2" = "%@ és %@ reagáltak a bejegyzésre amiben be voltál jelölve";

/* Notification that a user reposted a post that the current user was tagged in */
"reposted_tagged_in_1" = "%@ megosztotta a bejegyzést amiben be voltál jelölve";

/* Notification that 2 users reposted a post that the current user was tagged in */
"reposted_tagged_in_2" = "%@ és %@ megosztották a bejegyzést amiben be voltál jelölve";

/* Notification that a user zapped a post that the current user was tagged in */
"zapped_tagged_in_1" = "%@ Zap-elte a bejegyzést amiben be voltál jelölve";

/* Notification that 2 users zapped a post that the current user was tagged in */
"zapped_tagged_in_2" = "%@ és %@ Zap-elték a bejegyzést amiben be voltál jelölve";

/* Notification that a user reacted to the current user's post */
"reacted_your_post_1" = "%@ reagált a bejegyzésedre";

/* Notification that 2 users reacted to the current user's profile */
"reacted_your_post_2" = "%@ és %@ reagáltak a bejegyzésedre";

/* Notification that a user reposted the current user's post */
"reposted_your_post_1" = "%@ megosztotta a bejegyzésed";

/* Notification that 2 users reposted the current user's post */
"reposted_your_post_2" = "%@ és  %@ megosztották a bejegyzésed";

/* Notification that a user zapped the current user's post */
"zapped_your_post_1" = "%@ Zap-elte a bejegyzésed";

/* Notification that 2 users zapped the current user's post */
"zapped_your_post_2" = "%@ és %@ Zap-elték a bejegyzésed";

/* Notification that a user reacted to the current user's profile */
"reacted_your_profile_1" = "%@ reagált a profilodra";

/* Notification that 2 users reacted to the current user's profile */
"reacted_your_profile_2" = "%@ és %@ reagáltak a profilodra";

/* Notification that a user reposted the current user's profile */
"reposted_your_profile_1" = "%@ megosztotta a profilodat";

/* Notification that 2 users reposted the current user's profile */
"reposted_your_profile_2" = "%@ és %@ megosztották a profilodat";

/* Notification that a user zapped the current user's profile */
"zapped_your_profile_1" = "%@ Zap-elte a profilodat";

/* Notification that 2 users zapped the current user's profile */
"zapped_your_profile_2" = "%@ és %@ Zap-elték a profilodat";
/* No comment provided by engineer. */
"%@" = "%@";

/* Alert message that informs a user was blocked. */
"%@ has been blocked" = "%@ le lett tiltva";

/* When a note or profile is not found when searching for it via its note id */
"%@ not found" = "%@ nem található";

/* Explanation of what is done to keep personally identifiable information private. There is a heading that precedes this explanation which is a variable to this string. */
"%@. Creating an account doesn't require a phone number, email or name. Get started right away with zero friction." = "%@. A fiókod létrehozásához nem szükséges telefonszám, email vagy név megadása. Kezd el azonnal használni, minden probléma nélkül.";

/* Explanation of what is done to keep private data encrypted. There is a heading that precedes this explanation which is a variable to this string. */
"%@. End-to-End encrypted private messaging. Keep Big Tech out of your DMs" = "%@. A privát beszélgetések végponti titkosítással rendelkeznek. A privát üzeneteidet a tech óriásoktól távol tartja.";

/* Explanation of what can be done by users to earn money. There is a heading that precedes this explanation which is a variable to this string. */
"%@. Tip your friend's posts and stack sats with Bitcoin⚡️, the native currency of the internet." = "%@. Jattold a barátaid bejegyzéseit és gyűjts Bitcoin-t ⚡️, azaz az internet saját pénzét.";

/* Sentence composed of 2 variables to describe how many reactions there are on a post. In source English, the first variable is the number of reactions, and the second variable is 'Reaction' or 'Reactions'.
   Sentence composed of 2 variables to describe how many reposts. In source English, the first variable is the number of reposts, and the second variable is 'Repost' or 'Reposts'.
   Sentence composed of 2 variables to describe how many zap payments there are on a post. In source English, the first variable is the number of zap payments, and the second variable is 'Zap' or 'Zaps'. */
"%@.font(.body.bold())) %@" = "%1$@.font(.body.bold())) %2$@";

/* Sentence composed of 2 variables to describe how many people are following a user. In source English, the first variable is the number of followers, and the second variable is 'Follower' or 'Followers'.
   Sentence composed of 2 variables to describe how many profiles a user is following. In source English, the first variable is the number of profiles being followed, and the second variable is 'Following'.
   Sentence composed of 2 variables to describe how many relay servers a user is connected. In source English, the first variable is the number of relay servers, and the second variable is 'Relay' or 'Relays'. */
"%@.font(.subheadline.weight(.medium))) %@" = "%1$@.font(.subheadline.weight(.medium))) %2$@";

/* Fraction of how many of the user's relay servers that are operational. */
"%@/%@" = "%1$@/%2$@";

/* Description of how the nip05 identifier would be used for verification. */
"'%@' at '%@' will be used for verification" = "'%1$@' kukac '%2$@' az azonosításhoz lesz használva";

/* Description of why the nip05 identifier is invalid. */
"'%@' is an invalid NIP-05 identifier. It should look like an email." = "'%@' érvénytelen NIP-05 azonosító. Úgy kell kinézzen mint egy email cím.";

/* No comment provided by engineer. */
"@" = "@";

/* Label to prompt for about text entry for user to describe about themself. */
"About" = "Rólam";

/* Label for About Me section of user profile form. */
"About Me" = "Rólam";

/* Placeholder text for About Me description. */
"Absolute Boss" = "Egy Hős vagyok...";

/* Button to accept the end user license agreement before being allowed into the app. */
"Accept" = "Elfogadom";

/* Label to indicate the public ID of the account. */
"Account ID" = "Fiók azonosító";

/* Title for confirmation dialog to either share, report, or block a profile. */
"Actions" = "Lehetőségek";

/* Button to confirm adding user inputted relay. */
"Add" = "Hozzáad";

/* Button label to re-add all original participants as profiles to reply to in a note */
"Add all" = "Mind hozzáad";

/* Context menu option for adding a note bookmark. */
"Add Bookmark" = "Könyvjelző hozzáadása";

/* Button to add recommended relay server.
   Label for section for adding a relay server. */
"Add Relay" = "Csomópont hozzáadása";

/* Label to display relay contact user. */
"Admin" = "Admin";

/* Label for filter for all notifications. */
"All" = "Mind";

/* Setting to always show and never blur images */
"Always show images" = "Képek megjelenítése állandóan";

/* Picker option to indicate that a zap should be sent anonymously and not identify the user as who sent it. */
"Anonymous" = "Névtelenül";

/* Any amount of sats */
"Any" = "Bármennyi";

/* Prompt for optional entry of API Key to use translation server. */
"API Key (optional)" = "API Kulcs (opcionális)";

/* Prompt for required entry of API Key to use translation server. */
"API Key (required)" = "API Kulcs (szükséges)";

/* Alert message to ask if user wants to repost a post. */
"Are you sure you want to repost this?" = "Biztosan meg akarod osztani?";

/* Placeholder text for a comment to send as part of a zap to the user. */
"Awesome post!" = "Csodás bejegyzés!";

/* Label for Banner Image section of user profile form. */
"Banner Image" = "Banner Kép";

/* Reminder to user that they should save their account information. */
"Before we get started, you'll need to save your account info, otherwise you won't be able to login in the future if you ever uninstall Damus." = "Mielőtt elkezdjük, a fiókadataidat el kell mentened! Különben a jövőben nem fogsz tudni belépni, ha esetlegesen a Damus-t letörlöd.";

/* Dropdown option label for Lightning wallet, Bitcoin Beach. */
"Bitcoin Beach" = "Bitcoin Beach";

/* Label for Bitcoin Lightning Tips section of user profile form. */
"Bitcoin Lightning Tips" = "Bitcoin Lightning borravalók";

/* Dropdown option label for Lightning wallet, Blixt Wallet */
"Blixt Wallet" = "Blixt Wallet";

/* Alert button to block a user.
   Button to block a profile.
   Context menu option for blocking users. */
"Block" = "Tiltás";

/* Alert message prompt to ask if a user should be blocked. */
"Block %@?" = "Biztosan %@ letiltod?";

/* Title of alert for blocking a user. */
"Block User" = "Felhasználó letiltása";

/* Sidebar menu label for Profile view. */
"Blocked" = "Letiltva";

/* Navigation title of view to see list of blocked users. */
"Blocked Users" = "Letiltott felhasználók";

/* Dropdown option label for Lightning wallet, Blue Wallet. */
"Blue Wallet" = "Blue Wallet";

/* Sidebar menu label for Bookmarks view.
   Title of bookmarks view */
"Bookmarks" = "Könyvjelzők";

/* Accessibility label for boosts button */
"Boosts" = "Megosztás";

/* Dropdown option label for Lightning wallet, Breez. */
"Breez" = "Breez";

/* Button to broadcast note to all your relays
   Context menu option for broadcasting the user's note to all of the user's connected relay servers. */
"Broadcast" = "Kiküldés";

/* Alert button to cancel out of alert for blocking a user.
   Button to cancel a repost.
   Button to cancel out of alert that creates a new mutelist.
   Button to cancel out of posting a note.
   Button to cancel out of reposting a post.
   Button to cancel out of view adding user inputted relay.
   Cancel deleting the user.
   Cancel out of logging out the user.
   Cancel out of search view. */
"Cancel" = "Mégse";

/* Dropdown option label for Lightning wallet, Cash App. */
"Cash App" = "Cash App";

/* Button for clearing bookmarks data. */
"Clear All" = "Mind törlése";

/* Button to clear image cache. */
"Clear Cache" = "Gyorsítótár törlése";

/* Header text to indicate that the text field below it is a comment that will be used to send as part of a zap to the user. */
"Comment" = "Megjegyzés";

/* Label to display relay contact information. */
"Contact" = "Kapcsolat";

/* Continue with deleting the user. */
"Continue" = "Folytatás";

/* Label indicating that a user's key was copied. */
"Copied" = "Kimásolva";

/* Button to copy a relay server address. */
"Copy" = "Másolás";

/* Context menu option for copying the ID of the account that created the note. */
"Copy Account ID" = "Fiók azonosító másolása";

/* Context menu option to copy an image into clipboard.
   Context menu option to copy an image to clipboard. */
"Copy Image" = "Kép másolása";

/* Context menu option to copy the URL of an image into clipboard. */
"Copy Image URL" = "Kép címének másolása";

/* Title of section for copying a Lightning invoice identifier. */
"Copy invoice" = "Számla másolása";

/* Button to copy link to note */
"Copy Link" = "Link másolása";

/* Context menu option for copying a user's Lightning URL. */
"Copy LNURL" = "LNURL másolása";

/* Context menu option for copying the ID of the note. */
"Copy Note ID" = "Bejegyzés azonosító másolása";

/* Context menu option for copying the JSON text from the note. */
"Copy Note JSON" = "Bejegyzés JSON másolása";

/* Button to copy report ID. */
"Copy Report ID" = "Jelentés azonosító másolása";

/* Context menu option for copying the text from an note. */
"Copy Text" = "Szöveg másolása";

/* Context menu option for copying the ID of the user who created the note. */
"Copy User Pubkey" = "Publikus kulcs másolása";

/* Alert message to indicate that the blocked user could not be found. */
"Could not find user to block..." = "A tiltáshoz a felhasználó nem található...";

/* Button to create account. */
"Create" = "Létrehozás";

/* Button to create an account. */
"Create Account" = "Fiók létrehozása";

/* Title of alert prompting the user to create a new mutelist. */
"Create new mutelist" = "Új lista a némított felhasználókról";

/* Example description about Bitcoin creator(s), Satoshi Nakamoto. */
"Creator(s) of Bitcoin. Absolute legend." = "A Bitcoin készítője. Abszolút legenda.";

/* Dropdown option for selecting a custom translation server. */
"Custom" = "Egyedi";

/* Header text to indicate that the text field below it is to enter a custom zap amount. */
"Custom Zap Amount" = "Egyedi Zap Mennyiség";

/* Name of the app, shown on the first screen when user is not logged in. */
"Damus" = "Semaphore";

/* Dropdown option for selecting DeepL as the translation service. */
"DeepL (Proprietary, Higher Accuracy)" = "DeepL (Szabadalmaztatott, nagyobb pontosság)";

/* Button to pay a Lightning invoice with the user's default Lightning wallet. */
"Default Wallet" = "Alapértelmezett Tárca";

/* Section title for zap configuration */
"Default Zap Amount in sats" = "Alapértelmezett Zap összeg sats-ban";

/* Button for deleting the users account.
   Button to delete a relay server that the user connects to.
   Button to remove a user from their blocklist. */
"Delete" = "Törlés";

/* Button to delete the user's account. */
"Delete Account" = "Fiók törlése";

/* Alert message to indicate this is a deleted account */
"Deleted Account" = "Fiók törölve";

/* Label to display relay description. */
"Description" = "Leírás";

/* Button to disable image animation */
"Disable animations" = "Animációk kikapcsolása";

/* Button to dismiss a text field alert. */
"Dismiss" = "Elvetés";

/* Label to prompt display name entry. */
"Display Name" = "Megjelenítendő név";

/* Navigation title for DMs view, where DM is the English abbreviation for Direct Message.
   Navigation title for view of DMs, where DM is an English abbreviation for Direct Message.
   Picker option for DM selector for seeing only DMs that have been responded to. DM is the English abbreviation for Direct Message.
   Toolbar label for DMs view, where DM is the English abbreviation for Direct Message. */
"DMs" = "Privát Üzenetek";

/* Button to dismiss wallet selection view for paying Lightning invoice. */
"Done" = "Bezár";

/* Heading indicating that this application allows users to earn money. */
"Earn Money" = "Szerezz Pénzt";

/* Button to edit user's profile. */
"Edit" = "Szerkesztés";

/* Text indicating that the view is used for editing which participants are replied to in a note. */
"Edit participants" = "Résztvevők szerkesztése";

/* Heading indicating that this application keeps private messaging end-to-end encrypted. */
"Encrypted" = "Titkosítva";

/* Prompt for user to enter an account key to login. */
"Enter your account key to login:" = "Belépéshez add meg az azonosító kulcsodat:";

/* Message to display when there was an error fetching a lightning invoice while attempting to zap. */
"Error fetching lightning invoice" = "Hiba a Lightning számla lekérésekor";

/* Error message indicating why saving keys failed. */
"Error: %@" = "Hiba: %@";

/* Label indicating that the below text is the EULA, an acronym for End User License Agreement. */
"EULA" = "ÁSZF";

/* Description of public zap type where the zap is sent publicly and identifies the user who sent it. */
"Everyone on can see that you zapped" = "A Zap-ed mindenki láthatja ";

/* Button label text for filtering relay servers. */
"Filter" = "Szűrés";

/* Button to follow a user. */
"Follow" = "Követem";

/* Button to follow a user back. */
"Follow Back" = "Viszont Követem";

/* Text on QR code view to prompt viewer looking at screen to follow the user. */
"Follow me on nostr" = "Kövess a Nostr-án";

/* Label describing followers of a user.
   Navigation bar title for view that shows who is following a user. */
"Followers" = "Követők";

/* Navigation bar title for view that shows who a user is following. */
"Following" = "Követ(em)";

/* Label to indicate that the user is in the process of following another user. */
"Following..." = "Követem...";

/* Text to indicate that a user is following your profile. */
"Follows you" = "Követ téged";

/* Dropdown option for selecting Free plan for DeepL translation service. */
"Free" = "Ingyenes";

/* Button to navigate to DeepL website to get a translation API key. */
"Get API Key" = "Szerezz egy API kulcsot";

/* No comment provided by engineer. */
"Hello, World!" = "Helló, Világ!";

/* Button to hide a post from a user who has been blocked. */
"Hide" = "Elrejtés";

/* Button to hide the DeepL translation API key.
   Button to hide the LibreTranslate server API key. */
"Hide API Key" = "API-kulcs elrejtése";

/* Navigation bar title for Home view where posts and replies appear from those who the user is following. */
"Home" = "Főoldal";

/* Placeholder example text for profile picture URL. */
"https://example.com/pic.jpg" = "https://pelda.hu/kep.jpg";

/* Placeholder example text for website URL for user profile. */
"https://jb55.com" = "https://teoldalad.hu";

/* Button for user to report that the account or content has illegal content. */
"Illegal content" = "Illegális tartalom";

/* Section title for images configuration. */
"Images" = "Képek";

/* Error message indicating that an invalid account key was entered for login. */
"Invalid key" = "Érvénytelen kulcs";

/* Message to display when there was an error attempting to zap due to an invalid lightning address. */
"Invalid lightning address" = "Érvénytelen Lightning cím";

/* Title of alerting as invalid tip address. */
"Invalid Tip Address" = "Érvénytelen fizetés cím";

/* Button for user to report that the account or content has spam. */
"It's spam" = "Ez spam";

/* Placeholder example text for identifier used for NIP-05 verification. */
"jb55@jb55.com" = "pelda@pelda.hu";

/* Moves the post button to the left side of the screen */
"Left Handed" = "Balkezes";

/* Button to complete account creation and start using the app. */
"Let's go!" = "Kezdjük!";

/* Dropdown option for selecting LibreTranslate as the translation service. */
"LibreTranslate (Open Source)" = "LibreTranslate (Nyílt forráskódú)";

/* Placeholder text for entry of Lightning Address or LNURL. */
"Lightning Address or LNURL" = "Lightning cím vagy LNURL";

/* Indicates that the view is for paying a Lightning invoice. */
"Lightning Invoice" = "Lightning számla";

/* Accessibility Label for Like button */
"Like" = "Tetszik";

/* Dropdown option label for Lightning wallet, LNLink. */
"LNLink" = "LNLink";

/* Button text for loading more events, where the variable is the number of events. */
"Load %@ more" = "További %@ betöltése";

/* Face ID usage description shown when trying to access private key */
"Local authentication to access private key" = "Helyi hitelesítés a privát kulcs eléréséhez";

/* Dropdown option label for system default for Lightning wallet. */
"Local default" = "Helyi alapértelmezett";

/* Button to log into account.
   Button to log into an account.
   Title of view to log into an account. */
"Login" = "Bejelentkezés";

/* Alert for logging out the user.
   Button for logging out the user.
   Button to close the alert that informs that the current account has been deleted. */
"Logout" = "Kijelentkezés";

/* Label that appears when searching for note or profile */
"Looking for %@..." = "Keresem a %@...";

/* Reminder message in alert to get customer to verify that their private security account key is saved saved before logging out. */
"Make sure your nsec account key is saved before you logout or you will lose access to this account" = "Mielőtt kijelentkezel, győződj meg arról, hogy a fiókod kulcsát (nsec) elmentetted, különben ehhez a fiókhoz a hozzáférését elveszíted.";

/* Label for filter for seeing mention notifications (replies, etc). */
"Mentions" = "Említések";

/* Section header for miscellaneous user configuration */
"Miscellaneous" = "Vegyes";

/* Dropdown option label for Lightning wallet, Muun. */
"Muun" = "Muun";

/* Label for NIP-05 Verification section of user profile form. */
"NIP-05 Verification" = "NIP-05 Azonosítás";

/* Button to cancel out of posting a note after being alerted that it looks like they might be posting a private key. */
"No" = "Mégse";

/* Alert message prompt that asks if the user wants to create a new block list, overwriting previous block lists. */
"No block list found, create a new one? This will overwrite any previous block lists." = "Nem található tiltólista, hozzon létre újat? Ez felülír minden korábbi tiltólistát.";

/* No comment provided by engineer. */
"No data available" = "Nincs elérhető adat";

/* Description of anonymous zap type where the zap is sent anonymously and does not identify the user who sent it. */
"No one can see that you zapped" = "Senki sem láthatja, hogy a Zap-et te küldted";

/* Description of non-zap type where sats are sent to the user's wallet as a regular Lightning payment, not as a zap. */
"No zaps are sent, only a lightning payment." = "Nem Zap küldés, csak sima Lightning fizetés.";

/* No search results. */
"none" = "Nem található";

/* Dropdown option for selecting no translation service. */
"none_translation_service" = "Egyik sem";

/* Picker option to indicate that sats should be sent to the user's wallet as a regular Lightning payment, not as a zap. */
"none_zap_type" = "Egyik sem";

/* Dropdown option label for system default for NostrBuild image uploader. */
"NostrBuild" = "NostrBuild";

/* Dropdown option label for system default for NostrImg image uploader. */
"NostrImg" = "NostrImg";

/* Alert user that they might be attempting to paste a private key and ask them to confirm. */
"Note contains \"nsec1\" private key. Are you sure?" = "A bejegyzés \"nsec1\" privát kulcsot tartalmaz. Biztosan el akarod küldeni?";

/* Indicates that there are no notes in the timeline to view. */
"Nothing to see here. Check back later!" = "Nincs megjelenítendő bejegyzés. Nézz vissza később!";

/* Toolbar label for Notifications view. */
"Notifications" = "Értesítések";

/* String indicating that a given timestamp just occurred */
"now" = "most";

/* Prompt for user to enter in an account key to login. This text shows the characters the key could start with if it was a private key. */
"nsec1..." = "nsec1...";

/* Button for user to report that the account or content has nudity or explicit content. */
"Nudity or explicit content" = "Meztelenség vagy szókimondó tartalom";

/* Button to dismiss the alert. */
"Ok" = "Rendben";

/* Help text on green lock icon that explains that only the current user can see the message of a zap event and who sent the zap. */
"Only you can see this message and who sent it." = "Csak Te láthatod ezt az üzenetet és az aki küldte.";

/* Label indicating that a form input is optional. */
"optional" = "opcionális";

/* Section header that indicates the relay server requires payment. */
"Paid Relay" = "Fizetős Csomópont";

/* Button to pay a Lightning invoice. */
"Pay" = "Fizetés";

/* Navigation bar title for view to pay Lightning invoice. */
"Pay the Lightning invoice" = "A Lightning számla fizetése";

/* Alert for deleting the users account.
   Section title for deleting the user */
"Permanently Delete Account" = "Fiók végleges törlése";

/* Dropdown option label for Lightning wallet, Phoenix. */
"Phoenix" = "Phoenix";

/* Prompt selection of DeepL subscription plan to perform machine translations on notes */
"Plan" = "Csomag";

/* Instructions on how to filter a specific timeline feed by choosing relay servers to filter on. */
"Please choose relays from the list below to filter the current feed:" = "Az aktuális hírcsatorna szűréséhez, az alábbi listából válassza ki a csomópontokat:";

/* Button to post a note. */
"Post" = "Küldés";

/* Text to indicate that what is being shown is a post from a user who has been blocked. */
"Post from a user you've blocked" = "Bejegyzés egy letiltott felhasználótól";

/* Label for filter for seeing only posts (instead of posts and replies).
   Label for filter for seeing only your posts (instead of posts and replies). */
"Posts" = "Bejegyzések";

/* Label for filter for seeing posts and replies (instead of only posts).
   Label for filter for seeing your posts and replies (instead of only your posts). */
"Posts & Replies" = "Bejegyzések & Válaszok";

/* Heading indicating that this application keeps personally identifiable information private. A sentence describing what is done to keep data private comes after this heading.
   Picker option to indicate that a zap should be sent privately and not identify the user to the public. */
"Private" = "Privát";

/* Label to indicate that the text below is the user's private key used by only the user themself as a secret to login to access their account.
   Title of the secure field that holds the user's private key. */
"Private Key" = "Titkos Kulcs";

/* Description of private zap type where the zap is sent privately and does not identify the user to the public. */
"private_zap_description" = "Csak '%@' láthatja hogy Zap-elted";

/* Dropdown option for selecting Pro plan for DeepL translation service. */
"Pro" = "Profi";

/* Sidebar menu label for Profile view. */
"Profile" = "Profilom";

/* Label for Profile Picture section of user profile form. */
"Profile Picture" = "Profil Kép";

/* Picker option to indicate that a zap should be sent publicly and identify the user as who sent it. */
"Public" = "Publikus";

/* Section title for the user's public account ID. */
"Public Account ID" = "Publikus fiókazonosító";

/* Label indicating that the text is a user's public account key.
   Label to indicate that text below is the user's public key used by others to uniquely refer to the user. */
"Public Key" = "Publikus Kulcs";

/* Label indicating that the text is a user's public account key. */
"Public key" = "Publikus kulcs";

/* Prompt to ask user if the key they entered is a public key. */
"Public Key?" = "Publikus Kulcs?";

/* Navigation bar title for Reactions view. */
"Reactions" = "Reakciók";

/* Section title for recommend relay servers that could be added as part of configuration */
"Recommended Relays" = "Javasolt Csomópontok";

/* Button to reject the end user license agreement, which disallows the user from being let into the app. */
"Reject" = "Elutasítom";

/* Label to display relay address.
   Text field for relay server. Used for testing purposes. */
"Relay" = "Csomópont";

/* Header text for relay server list for configuration.
   Sidebar menu label for Relays view. */
"Relays" = "Csomópontok";

/* Description of what was done as a result of sending a report to relay servers. */
"Relays have been notified and clients will be able to use this information to filter content. Thank you!" = "A csomópontok értesítve lettek, és az ügyfelek ezeket az információkat a tartalom szűrésére felhasználhatják. Köszönöm!";

/* Button label to remove all participants from a note reply. */
"Remove all" = "Mind törlése";

/* Context menu option for removing a note bookmark. */
"Remove Bookmark" = "Könyvjelző törlése";

/* Accessibility label for reply button */
"Reply" = "Válasz";

/* Label to indicate that the user is replying to 1 user. */
"Replying to %@" = "Válasz neki: %@";

/* Label to indicate that the user is replying to 2 users. */
"Replying to %@ & %@" = "Válasz nekik: %1$@ és %2$@";

/* Label to indicate that the user is replying to themself. */
"Replying to self" = "Válasz magamnak";

/* Indicating that the user is replying to the following listed people. */
"Replying to:" = "Válasz nekik:";

/* Button to report a profile.
   Context menu option for reporting content.
   Label indicating that the current view is for the user to report content. */
"Report" = "Jelentem";

/* Label indicating that the text underneath is the identifier of the report that was sent to relay servers. */
"Report ID:" = "Jelentés azonosító";

/* Message indicating that a report was successfully sent to relay servers. */
"Report sent!" = "Jelentés elküldve!";

/* Button to confirm reposting a post.
   Title of alert for confirming to repost a post. */
"Repost" = "Megosztás";

/* Text indicating that the post was reposted (i.e. re-shared). */
"Reposted" = "Megosztva";

/* Navigation bar title for Reposts view. */
"Reposts" = "Megosztások";

/* Picker option for DM selector for seeing only message requests (DMs that someone else sent the user which has not been responded to yet). DM is the English abbreviation for Direct Message. */
"Requests" = "Kérések";

/* Button to retry completing account creation after an error occurred. */
"Retry" = "Újra";

/* Dropdown option label for Lightning wallet, River */
"River" = "River";

/* Example username of Bitcoin creator(s), Satoshi Nakamoto. */
"satoshi" = "satoshi";

/* Name of Bitcoin creator(s). */
"Satoshi Nakamoto" = "Satoshi Nakamoto";

/* Button for saving profile. */
"Save" = "Mentés";

/* Context menu option to save an image. */
"Save Image" = "Kép mentése";

/* Text on QR code view to prompt viewer to scan the QR code on screen with their device camera. */
"Scan the code" = "QR-kód beolvasása";

/* Navigation link to search hashtag. */
"Search hashtag: #%@" = "Hashtag keresése: #%@";

/* Placeholder text to prompt entry of search query. */
"Search..." = "Keresés...";

/* Section title for user's secret account login key. */
"Secret Account Login Key" = "Titkos fiókhoz bejelentkezési kulcs";

/* Title of section for selecting a Lightning wallet to pay a Lightning invoice. */
"Select a Lightning wallet" = "Válassz egy Lightning tárcát";

/* Prompt selection of user's default wallet */
"Select default wallet" = "Válaszd ki az alapértelmezett tárcát";

/* Prompt selection of user's image uploader */
"Select image uploader" = "Válaszd ki a képtárhelyet";

/* Text prompt for user to send a message to the other user. */
"Send a message to start the conversation..." = "A beszélgetés elindításához küldj egy üzenetet...";

/* Prompt selection of LibreTranslate server to perform machine translations on notes */
"Server" = "Szerver";

/* Prompt selection of translation service provider. */
"Service" = "Szolgáltató";

/* Navigation title for Settings view.
   Sidebar menu label for accessing the app settings */
"Settings" = "Beállítások";

/* Button to share a post
   Button to share an image.
   Button to share the link to a profile. */
"Share" = "Megosztás";

/* Title text to indicate that the buttons below are meant to be used to share a note with others. */
"Share Note" = "Bejegyzés megosztása";

/* Button to present iOS share sheet */
"Share Via..." = "Megosztás ezen...";

/* Button to show a post from a user who has been blocked.
   Toggle to show or hide user's secret account login key. */
"Show" = "Megmutat";

/* Button to show the DeepL translation API key.
   Button to show the LibreTranslate server API key. */
"Show API Key" = "API Kulcs megjelenítése";

/* Button to show entire note. */
"Show more" = "Mutass többet";

/* Toggle to show or hide selection of wallet. */
"Show wallet selector" = "Tárcaválasztó megjelenítése";

/* Section title for signing out */
"Sign Out" = "Kijelentkezés";

/* Sidebar menu label to sign out of the account. */
"Sign out" = "Kijelentkezés";

/* Label to display relay software. */
"Software" = "Szoftver";

/* Dropdown option label for Lightning wallet, Strike. */
"Strike" = "Strike";

/* Label to display relay's supported NIPs. */
"Supported NIPs" = "Támogatott NIP-ek";

/* Button to close out of alert that informs that the action to block a user was successful. */
"Thanks!" = "Köszönöm!";

/* Giving the description of the alert message. */
"The address should either begin with LNURL or should look like an email address." = "A címnek vagy LNURL-lel kell kezdődnie, vagy úgy kell kinéznie, mint egy e-mail cím.";

/* Button for user to report that the account is impersonating someone. */
"They are impersonating someone" = "Megszemélyesítenek valakit";

/* Footer description that explains that the relay server requires payment to post. */
"This is a paid relay, you must pay for posts to be accepted." = "Ez egy fizetős csomópont, fizetni kell a hozzászólások befogadásáért.";

/* Warning that the inputted account key is a public key and the result of what happens because of it. */
"This is a public key, you will not be able to make posts or interact in any way. This is used for viewing accounts from their perspective." = "Ez egy publikus kulcs, nem tud bejegyzéseket írni vagy bárminemű módon módosításokat végrehajtani. Ez a fiókok szemszögéből való megtekintésére szolgál.";

/* Warning that the inputted account key for login is an old-style and asking user to verify if it is a public key. */
"This is an old-style nostr key. We're not sure if it's a pubkey or private key. Please toggle the button below if this a public key." = "Ez egy régi típusú Nostr kulcs. Nem tudjuk biztosan, hogy ez egy publikus- vagy egy privát kulcs. Kérjük, kapcsold be az alábbi gombot, ha ez egy publikus kulcs.";

/* Label to describe that a public key is the user's account ID and what they can do with it. */
"This is your account ID, you can give this to your friends so that they can follow you. Tap to copy." = "Ez a fiókazonosítód, ezt megadhatod az ismerőseidnek, hogy tudjanak követni téged. Koppints a másoláshoz.";

/* Label to describe that a private key is the user's secret account key and what they should do with it. */
"This is your secret account key. You need this to access your account. Don't share this with anyone! Save it in a password manager and keep it safe!" = "Ez a titkos fiókkulcsod. Erre a fiókodhoz való hozzáféréshez van szükséged. Ezt ne oszd meg senkivel! Mentsd el egy jelszókezelőbe, és őrizd biztonságosan!";

/* Navigation bar title for note thread. */
"Thread" = "Gondolatmenet";

/* Button to translate note from different language. */
"Translate Note" = "Bejegyzés fordítása";

/* Button to indicate that the note has been translated from a different language. */
"Translated from \(lang)" = "Fordítás erről \(lang)";

/* Button to indicate that the note is in the process of being translated from a different language. */
"Translating from \(lang)..." = "Fordítás erről \(lang)...";

/* Section title for selecting the translation service. */
"Translations" = "Fordítók";

/* Text field prompt asking user to type the word DELETE to confirm that they want to proceed with deleting their account. The all caps lock DELETE word should not be translated. Everything else should. */
"Type DELETE to delete" = "A törléshez írd be a DELETE parancsot";

/* Text box prompt to ask user to type their post. */
"Type your post here..." = "Írd ide a bejegyzésedet...";

/* Button to unfollow a user. */
"Unfollow" = "Kikövet";

/* Label to indicate that the user is in the process of unfollowing another user. */
"Unfollowing..." = "Kikövetés...";

/* Toolbar label for the universal view where posts from all connected relay servers appear. */
"Universe 🛸" = "Globális 🛸";

/* Example URL to LibreTranslate server */
"URL" = "URL cím";

/* Alert message to indicate the user has been blocked */
"User blocked" = "Felhasználó letiltva";

/* Alert message that informs a user was blocked. */
"User has been blocked" = "Felhasználó sikeresen letiltva";

/* Label for Username section of user profile form.
   Label to prompt username entry. */
"Username" = "Felhasználónév";

/* Label to display relay software version.
   Section title for displaying the version number of the Damus app. */
"Version" = "Verzió";

/* Sidebar menu label for Wallet view. */
"Wallet" = "Tárca";

/* Dropdown option label for Lightning wallet, Wallet of Satoshi. */
"Wallet of Satoshi" = "Wallet of Satoshi";

/* Section title for selection of wallet. */
"Wallet Selector" = "Tárca választó";

/* Alert for deleting the users account. */
"WARNING:\n\nTHIS WILL SIGN AN EVENT THAT DELETES THIS ACCOUNT.\n\nYOU WILL NO LONGER BE ABLE TO LOG INTO DAMUS USING THIS ACCOUNT KEY.\n\n ARE YOU SURE YOU WANT TO CONTINUE?" = "FIGYELEM:\n\nEZ A MŰVELET A FIÓKODAT TÖRÖLŐ FOLYAMATÁT INDÍTJA EL.\n\nA TOVÁBBIAKBAN A DAMUSBA ENNEK A FIÓKULCS HASZNÁLATÁVAL, MÁR NEM LESZEL KÉPES BEJELENTKEZNI.\n\nBIZTOS VAGY BENNE, HOGY FOLYTATNI AKAROD?";

/* Label for Website section of user profile form. */
"Website" = "Weboldal";

/* Welcoming message to the reader. The variable is 'you', the reader. */
"Welcome to the social network %@ control." = "Üdvözlünk a közösségi hálózaton, %@ irányítasz!";

/* Text to welcome user. */
"Welcome, %@!" = "Üdvözöllek %@!";

/* Header text to prompt user what issue they want to report. */
"What do you want to report?" = "Mit akarsz jelenteni?";

/* Placeholder example for relay server address. */
"wss://some.relay.com" = "wss://valami.csomopont.hu";

/* Text of button that confirms to overwrite the existing mutelist. */
"Yes, Overwrite" = "Igen, Felülírás";

/* Button to proceed with posting a note even though it looks like they might be posting a private key. */
"Yes, Post with Private Key" = "Igen, küld a Privát Kulccsal együtt";

/* You, in this context, is the person who controls their own social network. You is used in the context of a larger sentence that welcomes the reader to the social network that they control themself. */
"you" = "Te";

/* Text indicating that there are no bookmarks to be viewed */
"You have no bookmarks yet, add them in the context menu" = "Még nincsenek könyvjelzőid, a helyi menüben tudod őket hozzá adni";

/* Label for Your Name section of user profile form. */
"Your Name" = "A neved";

/* Footer text to inform user what will happen when the report is submitted. */
"Your report will be sent to the relays you are connected to" = "A jelentésed azoknak a csomópontoknak kerül elküldésre, amelyekhez csatlakozva vagy";

/* Accessibility label for zap button
   Button to send a zap. */
"Zap" = "Zap";

/* Title of picker that allows selection of predefined amounts to zap. */
"Zap Amount" = "Zap Összeg";

/* Header text to indicate that the picker below it is to choose a pre-defined amount of sats to zap. */
"Zap Amount in sats" = "Zap Összeg sats-ban";

/* Header text to indicate that the picker below it is to choose the type of zap to send. */
"Zap Type" = "Zap Típusa";

/* Setting to enable vibration on zap */
"Zap Vibration" = "Zap Rezgés";

/* Text to indicate that the app is in the process of sending a zap. */
"Zapping..." = "Zap-elés...";

/* Label for filter for zap notifications.
   Navigation bar title for the Zaps view. */
"Zaps" = "Zap-ek";

/* Dropdown option label for Lightning wallet, Zebedee. */
"Zebedee" = "Zebedee";

/* Dropdown option label for Lightning wallet, Zeus LN. */
"Zeus LN" = "Zeus LN";

/* Text indicating the zap amount. i.e. number of satoshis that were tipped to a user */
"⚡️ %@" = "⚡️ %@";

